# task1
# HW_ivanov_semen.py

# Задание 1. Создать две переменные a=10, b=30. Вывести на экран
# результат математического взаимодействия (+, -, *, / ) этих чисел

a = 10; b = 30

print(a + b)
print(a - b)
print(a / b)
print(a * b)


# Задание 2. Создать переменную и поочередно записать в нее результат
# сравнения (<, > , ==, !=) чисел из задания 1. После этого вывести на
# экран значение каждой полученной переменной

comp_1 = a > b
comp_2 = a < b
comp_3 = a == b
comp_4 = a != b

print(comp_1)
print(comp_2)
print(comp_3)
print(comp_4)


# Задание 3. * Создать переменную - результат конкатенации (сложения)
# строк str1="Hello " и str2="world". Вывести ее на экран.

str1 = 'Hello '
str2 = 'World'

str_sum = str1 + str2

print(str_sum)


